<html>
  <head>
    <title>Parametri di scelta dell'abito</title>
  </head>
  <body>
    
    <h1>Parametri di scelta dell'abito</h1>

    <h3><a href="#introduction">1 Introduzione</a></h3>
    <h3><a href="#parameters">2 Parametri</a></h3>
    <h3><a href="#evaluation">3 Come sono valorizzati i parametri</a></h3>
    <h3><a href="#table_of_values">4 Tabella dei valori</a></h3>

    <h3><a name="introduction">1 Introduzione</a></h3>
    <p>
      Questa pagina mostra la lista dei parametri calcolati per la scelta
      dell'abito. Ogni parametro contribuisce a fornire un punteggio all'abito,
      l'abito con il punteggio pi&ugrave; alto &egrave; proposto nella
      selezione.
    </p>
    <h3><a name="parameters">2 Parametri</a></h3>
    <p>
      Il significato e il valore dei parametri sono spiegati di seguito:
      <h5>2.1 Preferenza</h5>
      &Egrave; calcolata in base al voto assegnato all'abito.
      <h5>2.2 Data di acquisto</h5>
      Pi&ugrave; &egrave; nuovo l'abito e maggiore sar&agrave; il punteggio.
      <h5>2.3 Ultima selezione</h5>
      Se l'abito &egrave; stato scelto recentemente avr&agrave; un punteggio
      basso.
      <h5>2.4 Totale selezioni</h5>
      Dipende da quante volte l'abito &egrave; stato selezionato negli ultimi
      30 giorni. Se &egrave; stato scelto spesso ottiene un punteggio basso.
      <h5>2.5 Casuale</h5>
      Un valore casuale per fare in modo che la scelta non sia deterministica.
    </p>
    <h3><a name="evaluation">3 Come sono valorizzati i parametri</a></h3>
    <p>
      Ogni parametro ha un valore assoluto e uno ponderato; il primo &egrave;
      calcolato in riferimento ai criteri spiegati sopra, il secondo &egrave;
      preso a partire dal primo, moltiplicato per un determinato coefficiente
      stabilito in base all'importanza del parametro nel conteggio globale.
    </p>
    <p>
      Ogni parametro deve essere compreso in una gamma determinata dal suo
      valore massimo e minimo.
    </p>
    <p>
      Il coefficiente usato per ottenere il valore ponderato pu&ograve; essere
      proporzionale o logaritmico; nel primo caso non ci sar&agrave; differenza
      relativa con il valore assoluto del parametro, nel secondo caso il valore
      calcolato sar&agrave; pi&ugrave; alto o basso in misura
      pi&ugrave;-che-proporzionale in relazione al valore assoluto stesso.
    </p>
    <p>
      Il parametro pu&ograve; inoltre essere positivo o negativo, da notare che
      nel caso di parametri logaritmici negativi la relazione proporzionale
      spiegata sopra &egrave; invertita.
    </p>
    <h3><a name="table_of_values">4 Tabella dei valori</a></h3>
    <p>
      Questa &egrave; la tabella riepilogativa delle propriet&agrave; dei
      parametri:
    </p>
    <p>
      <table border="1">
        <tr>
	  <td>
	    Parametro
	  </td>
	  <td>
	    +/-
	  </td>
	  <td>
	    Massimo
	  </td>
	  <td>
	    Minimo
	  </td>
	  <td>
	    Peso
	  </td>
	  <td>
	    Proporzionalit&agrave;
	  </td>
        </tr>
        <tr>
	  <td>
	    <b>Preferenza</b>
	  </td>
	  <td>
	    Positivo
	  </td>
	  <td>
	    0
	  </td>
	  <td>
	    10
	  </td>
	  <td>
	    1 1/2
	  </td>
	  <td>
	    Logaritmica
	  </td>
        </tr>
        <tr>
	  <td>
	    <b>Data di acquisto</b>
	  </td>
	  <td>
	    Negativo
	  </td>
	  <td>
	    0
	  </td>
	  <td>
	    12
	  </td>
	  <td>
	    1/4
	  </td>
	  <td>
	    Logaritmica
	  </td>
        </tr>
        <tr>
	  <td>
	    <b>Ultima selezione</b>
	  </td>
	  <td>
	    Positivo
	  </td>
	  <td>
	    0
	  </td>
	  <td>
	    30
	  </td>
	  <td>
	    1 1/2
	  </td>
	  <td>
	    Logaritmica
	  </td>
        </tr>
        <tr>
	  <td>
	    <b>Totale selezioni</b>
	  </td>
	  <td>
	    Negativo
	  </td>
	  <td>
	    0
	  </td>
	  <td>
	    30
	  </td>
	  <td>
	    2
	  </td>
	  <td>
	    Proporzionale
	  </td>
        </tr>
        <tr>
	  <td>
	    <b>Casuale</b>
	  </td>
	  <td>
	    Positivo
	  </td>
	  <td>
	    0
	  </td>
	  <td>
	    100
	  </td>
	  <td>
	    1/2
	  </td>
	  <td>
	    Proporzionale
	  </td>
        </tr>
      </table>
    </p>
  </body
</html>

